In [81]:
pwd

'C:\\Users\\USER\\Desktop\\Python_Basic'

In [5]:
import pandas as pd #데이터테이블,데이터프레임
import numpy as np # 수학 행렬

## Object creation

In [9]:
s = pd.Series([1, 3, 5, np.nan, 6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [12]:
dates = pd.date_range('20130101', periods=6, freq='d') #freq = 단위
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
#데이터 만들기
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-03 -2.556028  1.574782  1.421105  1.425739
2013-01-04  0.115169 -0.672145 -1.921395  1.276118
2013-01-05 -0.494744 -0.943768 -1.306766 -0.067280
2013-01-06 -0.386615  0.326955  0.032956 -0.781269

In [24]:
df2 = pd.DataFrame({'A':1,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(["test","train","test","tran"]),
                    'F': 'foo'})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3   tran  foo

In [25]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing data

In [28]:
df.head()

                   A         B         C         D
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-03 -2.556028  1.574782  1.421105  1.425739
2013-01-04  0.115169 -0.672145 -1.921395  1.276118
2013-01-05 -0.494744 -0.943768 -1.306766 -0.067280

In [29]:
df.head(3)

                   A         B         C         D
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-03 -2.556028  1.574782  1.421105  1.425739

In [30]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.115169 -0.672145 -1.921395  1.276118
2013-01-05 -0.494744 -0.943768 -1.306766 -0.067280
2013-01-06 -0.386615  0.326955  0.032956 -0.781269

In [31]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [32]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [33]:
df['B']

2013-01-01   -1.462051
2013-01-02   -3.124167
2013-01-03    1.574782
2013-01-04   -0.672145
2013-01-05   -0.943768
2013-01-06    0.326955
Freq: D, Name: B, dtype: float64

In [34]:
df.B

2013-01-01   -1.462051
2013-01-02   -3.124167
2013-01-03    1.574782
2013-01-04   -0.672145
2013-01-05   -0.943768
2013-01-06    0.326955
Freq: D, Name: B, dtype: float64

In [36]:
#문자열에 띄어쓰기가 있을시 []사용!

In [37]:
df.values

array([[-1.2071287 , -1.46205091,  1.82450708, -0.76861208],
       [ 0.2978948 , -3.12416665, -0.20764629,  0.50496417],
       [-2.55602825,  1.57478211,  1.42110495,  1.42573864],
       [ 0.11516924, -0.67214476, -1.92139539,  1.27611779],
       [-0.49474428, -0.94376804, -1.30676608, -0.06728029],
       [-0.38661467,  0.3269549 ,  0.03295587, -0.78126856]])

In [40]:
df.T #행렬의 Transpose -> 선형대수 (행렬을 바꿈)

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.207129    0.297895   -2.556028    0.115169   -0.494744   -0.386615
B   -1.462051   -3.124167    1.574782   -0.672145   -0.943768    0.326955
C    1.824507   -0.207646    1.421105   -1.921395   -1.306766    0.032956
D   -0.768612    0.504964    1.425739    1.276118   -0.067280   -0.781269

In [42]:
df.sort_index(axis=1,ascending=False) #axis = 1 행이바뀜 =0 열이바뀜

                   D         C         B         A
2013-01-01 -0.768612  1.824507 -1.462051 -1.207129
2013-01-02  0.504964 -0.207646 -3.124167  0.297895
2013-01-03  1.425739  1.421105  1.574782 -2.556028
2013-01-04  1.276118 -1.921395 -0.672145  0.115169
2013-01-05 -0.067280 -1.306766 -0.943768 -0.494744
2013-01-06 -0.781269  0.032956  0.326955 -0.386615

In [46]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-03 -2.556028  1.574782  1.421105  1.425739
2013-01-06 -0.386615  0.326955  0.032956 -0.781269
2013-01-04  0.115169 -0.672145 -1.921395  1.276118
2013-01-05 -0.494744 -0.943768 -1.306766 -0.067280
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612
2013-01-02  0.297895 -3.124167 -0.207646  0.504964

## Selection

### (1)Getting

In [48]:
df['A']

2013-01-01   -1.207129
2013-01-02    0.297895
2013-01-03   -2.556028
2013-01-04    0.115169
2013-01-05   -0.494744
2013-01-06   -0.386615
Freq: D, Name: A, dtype: float64

In [50]:
df[df['A']>0]

                   A         B         C         D
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-04  0.115169 -0.672145 -1.921395  1.276118

In [51]:
df[df['A']>0]['A']

2013-01-02    0.297895
2013-01-04    0.115169
Freq: 2D, Name: A, dtype: float64

In [52]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-03 -2.556028  1.574782  1.421105  1.425739

In [53]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-03 -2.556028  1.574782  1.421105  1.425739
2013-01-04  0.115169 -0.672145 -1.921395  1.276118

### (2)loc : 이름이로 데이터 가져오기

In [67]:
df

                   A         B         C         D
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-03 -2.556028  1.574782  1.421105  1.425739
2013-01-04  0.115169 -0.672145 -1.921395  1.276118
2013-01-05 -0.494744 -0.943768 -1.306766 -0.067280
2013-01-06 -0.386615  0.326955  0.032956 -0.781269

In [56]:
df.index[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [55]:
df.loc['2013-01-01','A']

-1.2071286962962116

In [59]:
df.loc[:,['A','B','D']]

                   A         B         D
2013-01-01 -1.207129 -1.462051 -0.768612
2013-01-02  0.297895 -3.124167  0.504964
2013-01-03 -2.556028  1.574782  1.425739
2013-01-04  0.115169 -0.672145  1.276118
2013-01-05 -0.494744 -0.943768 -0.067280
2013-01-06 -0.386615  0.326955 -0.781269

In [61]:
df.loc['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-03 -2.556028  1.574782  1.421105  1.425739
2013-01-04  0.115169 -0.672145 -1.921395  1.276118

### (3)iloc : 위치번호기준으로 가져오기

In [62]:
df

                   A         B         C         D
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-03 -2.556028  1.574782  1.421105  1.425739
2013-01-04  0.115169 -0.672145 -1.921395  1.276118
2013-01-05 -0.494744 -0.943768 -1.306766 -0.067280
2013-01-06 -0.386615  0.326955  0.032956 -0.781269

In [63]:
df.iloc[3]

A    0.115169
B   -0.672145
C   -1.921395
D    1.276118
Name: 2013-01-04 00:00:00, dtype: float64

In [64]:
df.iloc[3,3]

1.2761177853778993

In [65]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.297895 -0.207646
2013-01-03 -2.556028  1.421105
2013-01-05 -0.494744 -1.306766

### (4) Boolean indexing

In [136]:
df

        A  B    C         D         E
0     one  A  foo  0.316372  1.284493
1     one  B  foo  0.392676 -0.146953
2     two  C  foo -0.752262 -1.499306
3   three  A  bar -0.752027 -1.099779
4     one  B  bar -0.288829  0.399852
5     one  C  bar  0.552827 -1.299022
6     two  A  foo -0.303439 -0.238136
7   three  B  foo  1.091076 -0.618065
8     one  C  foo -1.066663  0.631434
9     one  A  bar  0.441617 -0.694524
10    two  B  bar -1.633537  0.200317
11  three  C  bar -0.336194  0.998644

In [138]:
df[df['D']>0]

       A  B    C         D         E
0    one  A  foo  0.316372  1.284493
1    one  B  foo  0.392676 -0.146953
5    one  C  bar  0.552827 -1.299022
7  three  B  foo  1.091076 -0.618065
9    one  A  bar  0.441617 -0.694524

In [139]:
df[df['E']>0]

        A  B    C         D         E
0     one  A  foo  0.316372  1.284493
4     one  B  bar -0.288829  0.399852
8     one  C  foo -1.066663  0.631434
10    two  B  bar -1.633537  0.200317
11  three  C  bar -0.336194  0.998644

In [135]:
df[(df['D']>0)&(df['E']>0)]

     A  B    C         D         E
0  one  A  foo  0.316372  1.284493

In [79]:
df2 = df.copy()
#새로운 컬럼 추가
df2['E']=['one','one','two','three','four','four']
df2

                   A         B         C         D      E
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612    one
2013-01-02  0.297895 -3.124167 -0.207646  0.504964    one
2013-01-03 -2.556028  1.574782  1.421105  1.425739    two
2013-01-04  0.115169 -0.672145 -1.921395  1.276118  three
2013-01-05 -0.494744 -0.943768 -1.306766 -0.067280   four
2013-01-06 -0.386615  0.326955  0.032956 -0.781269   four

In [80]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -2.556028  1.574782  1.421105  1.425739   two
2013-01-05 -0.494744 -0.943768 -1.306766 -0.067280  four
2013-01-06 -0.386615  0.326955  0.032956 -0.781269  four

## Missing data

데이터 분석
1. 데이터수집
2. nan, null, na -> 데이터가 빠진 부분들
  - 빈 값을 채워 넣거나 -> fillna
  - 해당되는 행이나 열을 제거 ->dropna

In [82]:
df

                   A         B         C         D
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612
2013-01-02  0.297895 -3.124167 -0.207646  0.504964
2013-01-03 -2.556028  1.574782  1.421105  1.425739
2013-01-04  0.115169 -0.672145 -1.921395  1.276118
2013-01-05 -0.494744 -0.943768 -1.306766 -0.067280
2013-01-06 -0.386615  0.326955  0.032956 -0.781269

In [87]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C         D   E
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612 NaN
2013-01-02  0.297895 -3.124167 -0.207646  0.504964 NaN
2013-01-03 -2.556028  1.574782  1.421105  1.425739 NaN
2013-01-04  0.115169 -0.672145 -1.921395  1.276118 NaN

In [89]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C         D    E
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612  1.0
2013-01-02  0.297895 -3.124167 -0.207646  0.504964  1.0
2013-01-03 -2.556028  1.574782  1.421105  1.425739  NaN
2013-01-04  0.115169 -0.672145 -1.921395  1.276118  NaN

In [90]:
df1=df1.dropna(how='any')
df1

                   A         B         C         D    E
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612  1.0
2013-01-02  0.297895 -3.124167 -0.207646  0.504964  1.0

In [92]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False

##  Operation

In [94]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C         D   E
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612 NaN
2013-01-02  0.297895 -3.124167 -0.207646  0.504964 NaN
2013-01-03 -2.556028  1.574782  1.421105  1.425739 NaN
2013-01-04  0.115169 -0.672145 -1.921395  1.276118 NaN

In [95]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C         D    E
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612  1.0
2013-01-02  0.297895 -3.124167 -0.207646  0.504964  1.0
2013-01-03 -2.556028  1.574782  1.421105  1.425739  NaN
2013-01-04  0.115169 -0.672145 -1.921395  1.276118  NaN

In [96]:
df1.mean()

A   -0.837523
B   -0.920895
C    0.279143
D    0.609552
E    1.000000
dtype: float64

In [97]:
df1.mean(1)

2013-01-01   -0.122657
2013-01-02   -0.305791
2013-01-03    0.466399
2013-01-04   -0.300563
Freq: D, dtype: float64

In [100]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)
s #shift= 행밀기

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [101]:
df.sub(s,axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03 -3.556028  0.574782  0.421105  0.425739
2013-01-04 -2.884831 -3.672145 -4.921395 -1.723882
2013-01-05 -5.494744 -5.943768 -6.306766 -5.067280
2013-01-06       NaN       NaN       NaN       NaN

### apply : df 각각의 함수에 작용

In [102]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -1.207129 -1.462051  1.824507 -0.768612
2013-01-02 -0.909234 -4.586218  1.616861 -0.263648
2013-01-03 -3.465262 -3.011435  3.037966  1.162091
2013-01-04 -3.350093 -3.683580  1.116570  2.438209
2013-01-05 -3.844837 -4.627348 -0.190196  2.370928
2013-01-06 -4.231452 -4.300393 -0.157240  1.589660

In [104]:
df.apply(lambda x : x.max() - x.min())

A    2.853923
B    4.698949
C    3.745902
D    2.207007
dtype: float64

## histogramming

In [107]:
s=pd.Series(np.random.randint(0,7,size=10))
s

0    0
1    5
2    2
3    2
4    6
5    3
6    1
7    6
8    3
9    3
dtype: int32

## Merge

### (1) Concat

In [109]:
df=pd.DataFrame(np.random.randn(10,4))

In [110]:
df

          0         1         2         3
0  1.139281 -0.433130  1.724229  1.352300
1 -0.190996 -0.054491  0.803784 -0.330944
2 -1.328787 -1.223680 -0.979837 -0.888196
3 -0.974194  0.376940  2.198035  0.149672
4 -0.288228 -0.449225 -0.264826  0.563243
5 -1.761924  0.374684 -0.521107  0.456780
6 -0.533192 -0.804593 -0.007117  0.943903
7 -0.007747 -1.298102  0.586715  0.625913
8  1.182858 -0.160166 -0.078045  0.521093
9  1.483378  0.310528 -1.652302  1.666377

In [117]:
pieces = [df[:3],df[3:7],df[7:]]

In [118]:
pd.concat(pieces)

          0         1         2         3
0  1.139281 -0.433130  1.724229  1.352300
1 -0.190996 -0.054491  0.803784 -0.330944
2 -1.328787 -1.223680 -0.979837 -0.888196
3 -0.974194  0.376940  2.198035  0.149672
4 -0.288228 -0.449225 -0.264826  0.563243
5 -1.761924  0.374684 -0.521107  0.456780
6 -0.533192 -0.804593 -0.007117  0.943903
7 -0.007747 -1.298102  0.586715  0.625913
8  1.182858 -0.160166 -0.078045  0.521093
9  1.483378  0.310528 -1.652302  1.666377

### (2) merge

In [113]:
left=pd.DataFrame({'key':['foo','foo'],'lval':[1, 2]})

In [115]:
right=pd.DataFrame({'key':['foo','foo'],'lval':[4,5]})

In [116]:
pd.merge(left,right,on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

## Grouping

### groupby

In [121]:
df=pd.DataFrame({'A':['foo','bar','foo','bar','foo','bar','foo','foo'],
                 'B':['one','one','two','three','two','two','one','three'],
                 'C':np.random.randn(8),
                 'D':np.random.randn(8)})

In [123]:
df.groupby('A').sum()

            C         D
A
bar  1.365861 -3.689255
foo -1.834304  1.700824

In [125]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.508015 -1.367385
    three -0.246574 -0.035948
    two    0.104420 -2.285922
foo one   -1.703949  1.253328
    three -1.332219  0.435339
    two    1.201864  0.012156

## Pivot tables : df를 우리가 원하는 구조로 재가공

In [127]:
df=pd.DataFrame({'A':['one','one','two','three']*3,
                 'B':['A','B','C']*4,
                 'C':['foo','foo','foo','bar','bar','bar']*2,
                 'D':np.random.randn(12),
                 'E':np.random.randn(12)})

In [128]:
df

        A  B    C         D         E
0     one  A  foo  0.316372  1.284493
1     one  B  foo  0.392676 -0.146953
2     two  C  foo -0.752262 -1.499306
3   three  A  bar -0.752027 -1.099779
4     one  B  bar -0.288829  0.399852
5     one  C  bar  0.552827 -1.299022
6     two  A  foo -0.303439 -0.238136
7   three  B  foo  1.091076 -0.618065
8     one  C  foo -1.066663  0.631434
9     one  A  bar  0.441617 -0.694524
10    two  B  bar -1.633537  0.200317
11  three  C  bar -0.336194  0.998644

In [131]:
pd.pivot_table(df, values='D',index=['A','B'], columns=['C'])

C             bar       foo
A     B
one   A  0.441617  0.316372
      B -0.288829  0.392676
      C  0.552827 -1.066663
three A -0.752027       NaN
      B       NaN  1.091076
      C -0.336194       NaN
two   A       NaN -0.303439
      B -1.633537       NaN
      C       NaN -0.752262